# rotate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..rotate Method
FamilyInstance Class See Also
---
The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool rotate()
```

Visual Basic
---
```text
Public Function rotate As Boolean
```

Visual C++
---
```text
public:
bool rotate()
```

# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace